// // // Користувач може оформити доставку товару до себе в країну, вказавши її при відвідуванні сторінки в prompt. Врахуй, користувач може ввести ім'я країни не тільки буквами нижнього регістра, а наприклад 'кИтАЙ'.

// // // Напиши скрипт який виводить повідомлення про вартість доставки в зазначену країну. Обов'язково використовуй switch. Формат повідомлення: 'Доставка в [країна] буде коштувати [ціна] кредитів'.

// // // Але доставка є не скрізь, якщо зазначеної країни немає в списку, то виводь в alert повідомлення 'У вашій країні доставка недоступна'.

// // // Нижче наведено список країн і вартість доставки.

// // // Китай - 100 кредитів
// // // Чилі - 250 кредитів
// // // Австралія - 170 кредитів
// // // Індія - 80 кредитів
// // // Ямайка - 120 кредитів

let cost;
let country = prompt("Введіть назву країни: ");
country = country[0].toUpperCase().concat(country.slice(1));

/**
 * 1. Запрашиваем у пользователя страну
 * 2. Проверяем значение: строка или null
 * 3. Если null - "Отменено пользователем"
 * 4. Если строка обрезаем пробелы string.trim()
 *
 * 5. почитать за метод строки .slice(start, end)
 */

switch (country) {
  case "Китай":
    cost = 100;
    alert(`Доставка в ${country} буде коштувати ${cost} кредитів`);
    break;

  case "Чилі":
    cost = 250;
    alert(`Доставка в ${country} буде коштувати ${cost} кредитів`);
    break;

  case "Австралія":
    cost = 170;
    alert(`Доставка в ${country} буде коштувати ${cost} кредитів`);
    break;

  case "Індія":
    cost = 80;
    alert(`Доставка в ${country} буде коштувати ${cost} кредитів`);
    break;

  case "Ямайка":
    cost = 120;
    alert(`Доставка в ${country} буде коштувати ${cost} кредитів`);
    break;
  case country === null:
    console.log(отмена);
  default:
    alert("У вашій країні доставка недоступна");
}
